# Подключение библиотек
import pandas as pd
from matplotlib import pyplot as plt

# Загргузка данных
data = pd.read_csv("Titanic_modified.csv")

# Описание датасета
print("==============================================")
print("        🚢 ОПИСАНИЕ ФАЙЛА TITANIC 🚢          ")
print("==============================================")
print(
    f"↔️ Количество строк: {data.shape[0]}       "
    f"↕️ Количество столбцов: {data.shape[1]}"
)
print("==============================================")
print("🗂️ Названия столбцов и за что они отвечают:🗂️")
print(f"{data.columns[0]} - 🧑‍✈️ Пассажир")
print(f"{data.columns[1]} - 📝 Выживший")
print(f"{data.columns[2]} - 🏷️ Имя")
print(f"{data.columns[3]} - 🧍‍♂️/🧍‍♀️Пол")
print(f"{data.columns[4]} - 🎂 Возраст")
print(f"{data.columns[5]} - 💳 Билет")
print(f"{data.columns[6]} - 💸 Цена")
print(f"{data.columns[7]} - ⚓ Каюта")
print("==============================================")

# Удление ненужных столбцов
print("Удалим ненужные столбцы: билеты и каюты")
data.drop(['Ticket', 'Cabin'], axis=1, inplace=True)

# Вывод подготавливаемого датасета
print("       📊Вид датасета📊")
print(data)

# Проверка пропущенных значений
print("==============================================")
print(f"В каких столбцах и сколько пропущенных данных: \n{data.isnull().sum()}")

# Заполнение пропусков в столбце 'Age' медианой
print("==============================================")
print("Заменим пустые значения в столбце возраста на медианное значение")
data['Age'].fillna(data['Age'].median(), inplace=True)

# Итоговый вывод
print("         📊Подготовенный датасет📊")
print(data)

# Гистограмма цен с помощью библиотеки matplotlib (по x значения связанные)
print("==============================================")
print("              Визуализация цен")
plt.figure(figsize=(10, 6))
plt.hist(data['Fare'], bins=30)
plt.title('Распределение цен')
plt.xlabel('Цена')
plt.ylabel('Номер пассажира')
plt.show()

print("==============================================")
print("              Визуализация пола")
# Сколько раз встречается каждя категория (одномерный массив)
sex_counts = data['Sex'].value_counts()

plt.figure(figsize=(8, 5))
#Столбчатая диаграмма (по х значения несвязанные), столбцы для каждой категории, цвет
sex_counts.plot(kind='bar', color=['skyblue', 'pink'])
plt.title('Распределение пола пассажиров')
plt.xlabel('Пол')
plt.ylabel('Количество пассажиров')
plt.xticks(rotation=0)  # Подписи по оси X горизонтальные
plt.show()
