# Подключение библиотек
import pandas as pd

# Загргузка данных
data = pd.read_csv("Titanic_modified.csv")

# Описание датасета
print("==============================================")
print("        🚢 ОПИСАНИЕ ФАЙЛА TITANIC 🚢          ")
print("==============================================")
print(f"↔️ Количество строк: {data.shape[0]} ↕️ Количество столбцов: {data.shape[1]}")
print("===========================================")
print("🗂️ Названия столбцов и за что они отвечают:🗂️")
print(f"{data.columns[0]} - 🧑‍✈️ Пассажир")
print(f"{data.columns[1]} - 📝 Выживший")
print(f"{data.columns[2]} - 🏷️ Имя")
print(f"{data.columns[3]} - 🧍‍♂️/🧍‍♀️Пол")
print(f"{data.columns[4]} - 🎂 Возраст")
print(f"{data.columns[5]} - 💳 Билет")
print(f"{data.columns[6]} - 💸 Цена")
print(f"{data.columns[7]} - ⚓ Каюта")
print("===========================================")
print("                 📊Вид📊")
print(data)
